; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v5 - type_2 ?v1 - type_3)
 	      (pred_3 ?v6 - object ?v1 - type_3)
	      (pred_2 ?v5 - type_2 ?v7 - type_1)
	      (pred_4 ?v5 - type_2 ?v6 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v5 - type_2 ?v2 ?v4 - type_3)
       :precondition (and  (pred_1 ?v5 ?v2))
       :effect (and  (pred_1 ?v5 ?v4)
		     (not (pred_1 ?v5 ?v2))))

   (:action op_3
       :parameters (?v5 - type_2 ?v3 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v8) (pred_1 ?v5 ?v8) (pred_2 ?v5 ?v7))
       :effect (and (pred_4 ?v5 ?v3 ?v7)
		    (not (pred_3 ?v3 ?v8)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_2
       :parameters (?v5 - type_2 ?v3 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v3 ?v7) (pred_1 ?v5 ?v8))
       :effect (and (pred_3 ?v3 ?v8)
		    (pred_2 ?v5 ?v7)
		    (not (pred_4 ?v5 ?v3 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_04 obj_08 - type_1
obj_01 obj_03 obj_05 - type_3
obj_02 obj_09 obj_07 - object)
(:init
(pred_1 obj_06 obj_05)
(pred_2 obj_06 obj_04)
(pred_2 obj_06 obj_08)
(pred_3 obj_02 obj_01)
(pred_3 obj_09 obj_05)
(pred_3 obj_07 obj_01)
)
(:goal
(and
(pred_3 obj_02 obj_05)
(pred_3 obj_09 obj_05)
(pred_3 obj_07 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_06 ?b obj_04))))
)
)

; plan
1. (op_1 obj_06 obj_05 obj_01)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_01)
   goals met: 1 of 3
2. (op_3 obj_06 obj_07 obj_01 obj_08)
   deleted: (pred_3 obj_07 obj_01) (pred_2 obj_06 obj_08)
   added: (pred_4 obj_06 obj_07 obj_08)
   goals met: 1 of 3
3. (op_1 obj_06 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_05)
   goals met: 1 of 3
4. (op_2 obj_06 obj_07 obj_05 obj_08)
   deleted: (pred_4 obj_06 obj_07 obj_08)
   added: (pred_3 obj_07 obj_05) (pred_2 obj_06 obj_08)
   goals met: 2 of 3
5. (op_1 obj_06 obj_05 obj_01)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_01)
   goals met: 2 of 3
6. (op_3 obj_06 obj_02 obj_01 obj_08)
   deleted: (pred_3 obj_02 obj_01) (pred_2 obj_06 obj_08)
   added: (pred_4 obj_06 obj_02 obj_08)
   goals met: 2 of 3
7. (op_1 obj_06 obj_01 obj_05)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_05)
   goals met: 2 of 3
8. (op_2 obj_06 obj_02 obj_05 obj_08)
   deleted: (pred_4 obj_06 obj_02 obj_08)
   added: (pred_3 obj_02 obj_05) (pred_2 obj_06 obj_08)
   goals met: 3 of 3
